client/src/main/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://ilyachuvaev.com/soapservice"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xsi:schemaLocation="http://ilyachuvaev.com/soapservice ">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getContactDetails>
            <gs:id>1</gs:id>
        </gs:getContactDetails>
    </soapenv:Body>
</soapenv:Envelope>